load-test/test.yml
config:
  target: "http://localhost:8081"
  processor: "./processors/jwt.js"
  plugins:
    fake-data: {}
  phases:
    - name: "Warm up"
      duration: 60
      arrivalRate: 5
    - name: "Ramp up to 50/s"
      duration: 120
      arrivalRate: 5
      rampTo: 50
    - name: "Sustained load 50/s"
      duration: 180
      arrivalRate: 50
    - name: "Spike to 100/s"
      duration: 60
      arrivalRate: 100
    - name: "Ramp down"
      duration: 60
      arrivalRate: 100
      rampTo: 5

scenarios:
  - name: "Complete User Flow"
    flow:
      - function: "generateUsername"

      - post:
          url: "/auth/register"
          json:
            username: "{{ username }}"
            password: "Test123!"
            displayName: "{{ $randFullName() }}"
          capture:
            - json: "$.token"
              as: "authToken"

      - function: "decodeToken"

      - post:
          url: "/auth/login"
          json:
            username: "{{ username }}"
            password: "Test123!"
          capture:
            - json: "$.token"
              as: "authToken"

      - function: "decodeToken"

      - post:
          url: "http://localhost:8082/queue/join"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            playerId: "{{ userId }}"

      - get:
          url: "http://localhost:8082/queue"
          headers:
            Authorization: "Bearer {{ authToken }}"

      - post:
          url: "http://localhost:8082/queue/leave"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            playerId: "{{ userId }}"

      - post:
          url: "http://localhost:8083/purchases"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            userId: "{{ userId }}"
            itemName: "{{ $randProduct().title }}"
            price: "{{ $randNumber(100, 1000) }}"

      - get:
          url: "http://localhost:8083/purchases/user/{{ userId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"